In [1]:
import numpy as np
import matplotlib.pyplot as plt
from sklearn import datasets as dt
from sklearn.linear_model import LogisticRegression
import pandas as pd
import math
from sklearn.preprocessing import StandardScaler

In [2]:
traindata=np.genfromtxt("C:\\Users\\hp\\Coding Ninjas\\Lectures\\Lect 6\\ASSIGNMENT\\titanic train data.csv",delimiter=",",usecols=(0,1,2,3,4,5,6,7,8,9,10))
testdata=np.genfromtxt("C:\\Users\\hp\\Coding Ninjas\\Lectures\\Lect 6\\ASSIGNMENT\\titanic test data.csv",delimiter=",",usecols=(0,1,2,3,4,5,6,7,8,9))

In [3]:
traindata.shape,testdata.shape

((669, 11), (224, 10))

In [4]:
xtrain=traindata[:,0:10]
ytrain=traindata[:,-1]
xtrain.shape,ytrain.shape

((669, 10), (669,))

In [5]:
#Getting The Test data out of testdata
xtest=testdata
xtest.shape

(224, 10)

USING PANDAS FROM HERE

In [6]:
#Extracting train and test dataset

train_dataset = pd.read_csv("C:\\Users\\hp\\Coding Ninjas\\Lectures\\Lect 6\\ASSIGNMENT\\titanic train data.csv")
test_dataset = pd.read_csv("C:\\Users\\hp\\Coding Ninjas\\Lectures\\Lect 6\\ASSIGNMENT\\titanic test data.csv")
train_dataset.shape,test_dataset.shape
#type(train_dataset)

((668, 11), (223, 10))

In [7]:
train_dataset.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [8]:
test_dataset.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [9]:
x_train=train_dataset.iloc[:,0:10]
y_train=train_dataset.iloc[:,-1]
x_test=test_dataset
x_train.shape,y_train.shape,x_test.shape

((668, 10), (668,), (223, 10))

In [10]:
x_train.head()
#type(x_train)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S

In [11]:
y_train.head()

0    1
1    0
2    0
3    0
4    0
Name: Survived, dtype: int64

In [12]:
x_train.describe()
columns=x_train.describe().columns
#ACCORDING TO THIS WE NEED TO ADD MEAN VALUES ONLY TO "AGE"
#REST OTHERS DON'T HAVE NULL VALUES
columns

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [13]:
x_test.describe()
#We need to add emean values to age column in test as well

           Pclass         Age       SibSp       Parch        Fare
count  223.000000  178.000000  223.000000  223.000000  223.000000
mean     2.345291   29.694775    0.506726    0.304933   32.622551
std      0.850047   15.398053    1.169700    0.634108   61.062047
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   19.250000    0.000000    0.000000    7.879200
50%      3.000000   27.000000    0.000000    0.000000   12.475000
75%      3.000000   37.750000    1.000000    0.000000   30.035400
max      3.000000   71.000000    8.000000    2.000000  512.329200

In [14]:
y_train.describe()

count    668.000000
mean       0.402695
std        0.490808
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Survived, dtype: float64

In [15]:
#ALL THE 10 COLUMNS NAME IN X_train
x_train.columns

Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [16]:
#Adding mean values to "Age" column in BOTH x_train and x_test

x_train['Age'].fillna(x_train['Age'].mean(),inplace=True)
x_test['Age'].fillna(x_test['Age'].mean(),inplace=True)

In [17]:
x_train.describe()

           Pclass         Age       SibSp       Parch        Fare
count  668.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552
std      0.831638   12.753571    1.080327    0.854695   45.320835
min      1.000000    0.670000    0.000000    0.000000    0.000000
25%      2.000000   23.000000    0.000000    0.000000    7.925000
50%      3.000000   29.700560    0.000000    0.000000   14.750000
75%      3.000000   35.000000    1.000000    0.000000   31.275000
max      3.000000   80.000000    8.000000    6.000000  512.329200

In [18]:
x_test.describe()

           Pclass         Age       SibSp       Parch        Fare
count  223.000000  223.000000  223.000000  223.000000  223.000000
mean     2.345291   29.694775    0.506726    0.304933   32.622551
std      0.850047   13.749153    1.169700    0.634108   61.062047
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   22.000000    0.000000    0.000000    7.879200
50%      3.000000   29.694775    0.000000    0.000000   12.475000
75%      3.000000   35.000000    1.000000    0.000000   30.035400
max      3.000000   71.000000    8.000000    2.000000  512.329200

In [19]:
x_train.shape,y_train.shape,x_test.shape

((668, 10), (668,), (223, 10))

In [20]:
#CONVERTING PANDAS.DATAFRAMSE INTO NP.NDARRAYS FOR FURTHER USE IN CALCULATING M

x_train.columns
x_train.drop(["Name","Sex","Ticket","Cabin","Embarked","Fare"],axis=1,inplace=True)
x_test.drop(["Name","Sex","Ticket","Cabin","Embarked","Fare"],axis=1,inplace=True)

In [21]:
x_train.head()

   Pclass       Age  SibSp  Parch
0       2  29.00000      1      0
1       3  29.70056      0      0
2       2  39.00000      0      0
3       3  29.00000      0      4
4       3  25.00000      0      0

In [22]:
x_test.head()

   Pclass        Age  SibSp  Parch
0       2   8.000000      1      1
1       1  49.000000      0      0
2       3  29.694775      0      0
3       2  24.000000      2      1
4       1  36.000000      0      0

In [23]:
x_train.shape,x_test.shape,y_train.shape

((668, 4), (223, 4), (668,))

In [24]:
#CONVERTING PANDAS.DATAFRAMSE INTO NP.NDARRAYS FOR FURTHER USE IN CALCULATING M

xtrain=np.array(x_train)
ytrain=np.array(y_train)
xtest=np.array(x_test)

#ytrain=ytrain.reshape(xtrain.shape[0],1)
xtrain.shape,ytrain.shape,xtest.shape
#xtrain=xtrain.reshape()

((668, 4), (668,), (223, 4))

In [25]:
#CHECKING THE SCORE
#NOTE:-WE CAN'T PREDICT THE SCORE OF N FEATURE DATASET BY USING PREDEIFINED PREDICT()
#SO WE NEED TO FIND m USING GD THEN PREDICTING
#ON SCALING SCORE IS DEGRADING SO DON'T SCALE
cl=LogisticRegression()

#l1=[]
#l2=[]
#for i in range(xtrain.shape[0]):
    #l1.append((xtrain[:,3]**2)+xtrain[:,0]+xtrain[:,2]+xtrain[:,4]+xtrain[:,1])
#    l2.append(xtrain[:,2]*2)
    
#xtrain=np.append(xtrain,l1,axis=1)
#xtrain=np.append(xtrain,l2,axis=1)

cl.fit(xtrain,ytrain)
cl.score(xtrain, ytrain)

0.7005988023952096

In [26]:
def score(y, y_pred):
    u = ((y - y_pred)**2).sum()
    v = ((y - y.mean())**2).sum()
    return 1 - u/v

In [27]:
# calculate cost function
def cost(x, y, m):
    mx=np.dot(x,m)
    hx=1/(1+np.exp(-mx))
    return ((-y*np.log(hx))-((1-y)*np.log(1-hx))).sum()

In [28]:
# calculate gradients and update m & b values
def step_gradient(x, y, learning_rate, m, batch_size):
    k = x.shape[0]
    n = x.shape[1]
    num_batches = math.ceil(k/batch_size)
    
    for b in range(num_batches):
        start = b * batch_size 
        end = min((b + 1) * batch_size, k)
        slope_m = np.zeros((n, 1))
        for j in range(n):
            for i in range(start, end, 1):
                mx=np.dot(x[i],m)
                hx=1/(1+np.exp(0-mx))
                slope_m[j][0] += (x[i][j]*(hx-y[i][0]))   
        m = m - learning_rate * slope_m
    return m

In [29]:
# running multiple iterations of step gradient
def gradient_descent(x, y, learning_rate = 0.1, num_iter = 100, batch_size = 32):
    m = np.random.random((x.shape[1], 1))
    print("Start : ", cost(x, y, m))
    for i in range(num_iter):
        m = step_gradient(x, y, learning_rate, m, batch_size)
        if (i % (num_iter//10) == 0):
            print(i, " : ", cost(x, y, m))
    print("End : ", cost(x, y, m))
    return m

In [30]:
# data loading & calling gradient descent
def run(x, y):
    learning_rate = 0.1
    num_iter = 1500
    m = gradient_descent(x, y, learning_rate, num_iter)
    return m

In [31]:
#m=run(xtrain,ytrain)
#m
xtrain.shape,ytrain.shape

((668, 4), (668,))

In [32]:
pred=cl.predict(x_test)
np.savetxt("C:\\Users\\hp\\Coding Ninjas\\Lectures\\Lect 6\\Assignment\\resultitanic.csv",pred,fmt="%d")